name: "net"
reduced_memory_inference: true
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  bottom_data_type: CAFFE_FLOAT
  compute_data_type: CAFFE_FLOAT
  top_data_type: CAFFE_FLOAT
  transform_param {
    mirror: false
    crop_size: 227
    mean_file: "/media/scratch/ILSVRC2012/data//imagenet_mean.binaryproto"
  }
  data_param {
    source: "/media/scratch/ILSVRC2012/data//ilsvrc12_val_lmdb"
    batch_size: 4096
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  bottom_data_type: CAFFE_FLOAT
  compute_data_type: CAFFE_FLOAT
  top_data_type: CAFFE_FLOAT
  transform_param {
    mirror: true
    crop_size: 227
    mean_file: "/media/scratch/ILSVRC2012/data//imagenet_mean.binaryproto"
  }
  data_param {
    source: "/media/scratch/ILSVRC2012/data//ilsvrc12_train_lmdb"
    batch_size: 4096
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  bottom_data_type: CAFFE_HALF
  compute_data_type: CAFFE_HALF
  top_data_type: CAFFE_HALF
  convolution_param {
    num_output: 48
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "relu1"
  bottom_data_type: CAFFE_HALF
  compute_data_type: CAFFE_HALF
  top_data_type: CAFFE_HALF
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "relu1"
  top: "pool1"
  bottom_data_type: CAFFE_HALF
  compute_data_type: CAFFE_HALF
  top_data_type: CAFFE_HALF
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  bottom_data_type: CAFFE_FLOAT
  compute_data_type: CAFFE_FLOAT
  top_data_type: CAFFE_FLOAT
  lrn_param {
    local_size: 5
    alpha: 9.999999747378752e-05
    beta: 0.75
    engine: CAFFE
  }
}
layer {
  name: "moe"
  type: "MOE"
  bottom: "norm1"
  top: "moe"
  top: "observed_count"
  top: "expected_count"
  bottom_data_type: CAFFE_HALF
  compute_data_type: CAFFE_HALF
  top_data_type: CAFFE_FLOAT
  moe_param {
    gating_net {
      reduced_memory_inference: true
      layer {
        name: "ga_input"
        type: "Input"
        top: "ga_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 4096
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ga_conv2"
        type: "Convolution"
        bottom: "ga_input"
        top: "ga_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ga_relu2"
        type: "ReLU"
        bottom: "ga_conv2"
        top: "ga_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ga_pool2"
        type: "Pooling"
        bottom: "ga_relu2"
        top: "ga_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ga_norm2"
        type: "LRN"
        bottom: "ga_pool2"
        top: "ga_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ga_fc1"
        type: "InnerProduct"
        bottom: "ga_norm2"
        top: "ga_fc1"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 128
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ga_relu3"
        type: "ReLU"
        bottom: "ga_fc1"
        top: "ga_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ga_fc2"
        type: "InnerProduct"
        bottom: "ga_relu3"
        top: "ga_fc2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 0.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 16
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ga_fc3"
        type: "InnerProduct"
        bottom: "ga_relu3"
        top: "ga_fc3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 0.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 16
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ga_relu4"
        type: "ReLU"
        bottom: "ga_fc3"
        top: "ga_relu4"
      }
      layer {
        name: "ga_noise"
        type: "Noise"
        bottom: "ga_relu4"
        top: "ga_noise"
        noise_param {
          mu: 0.0
          sigma: 1.0
        }
      }
      layer {
        name: "ga_eltwise1"
        type: "Eltwise"
        bottom: "ga_fc2"
        bottom: "ga_noise"
        top: "ga_eltwise1"
      }
      layer {
        name: "ga_dummy"
        type: "DummyData"
        top: "ga_dummy"
        dummy_data_param {
          data_filler {
            type: "gaussian"
            std: 10.0
          }
          shape {
            dim: 4096
            dim: 16
            dim: 1
            dim: 1
          }
        }
      }
      layer {
        name: "ga_dummy_conv"
        type: "Convolution"
        bottom: "ga_dummy"
        top: "ga_dummy_conv"
        param {
          lr_mult: 9.999999747378752e-06
          decay_mult: 1.0
        }
        param {
          lr_mult: 0.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 16
          pad: 0
          kernel_size: 1
          group: 16
          weight_filler {
            type: "constant"
            value: 1.0
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ga_dummy_reshaped"
        type: "Reshape"
        bottom: "ga_dummy_conv"
        top: "ga_dummy_reshaped"
        reshape_param {
          shape {
            dim: 4096
            dim: 16
          }
        }
      }
      layer {
        name: "ga_eltwise2"
        type: "Eltwise"
        bottom: "ga_eltwise1"
        bottom: "ga_dummy_reshaped"
        top: "ga_eltwise2"
      }
      layer {
        name: "ga_softmax"
        type: "Softmax"
        bottom: "ga_eltwise2"
        top: "ga_softmax"
      }
    }
    expert_net {
      reduced_memory_inference: true
      layer {
        name: "ex_0_input"
        type: "Input"
        top: "ex_0_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 1
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ex_0_conv2"
        type: "Convolution"
        bottom: "ex_0_input"
        top: "ex_0_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_0_relu2"
        type: "ReLU"
        bottom: "ex_0_conv2"
        top: "ex_0_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_0_pool2"
        type: "Pooling"
        bottom: "ex_0_relu2"
        top: "ex_0_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_0_norm2"
        type: "LRN"
        bottom: "ex_0_pool2"
        top: "ex_0_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ex_0_conv3"
        type: "Convolution"
        bottom: "ex_0_norm2"
        top: "ex_0_conv3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ex_0_relu3"
        type: "ReLU"
        bottom: "ex_0_conv3"
        top: "ex_0_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_0_conv4"
        type: "Convolution"
        bottom: "ex_0_relu3"
        top: "ex_0_conv4"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_0_relu4"
        type: "ReLU"
        bottom: "ex_0_conv4"
        top: "ex_0_relu4"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_0_conv5"
        type: "Convolution"
        bottom: "ex_0_relu4"
        top: "ex_0_conv5"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_0_relu5"
        type: "ReLU"
        bottom: "ex_0_conv5"
        top: "ex_0_relu5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_0_pool5"
        type: "Pooling"
        bottom: "ex_0_relu5"
        top: "ex_0_pool5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_0_fc6"
        type: "InnerProduct"
        bottom: "ex_0_pool5"
        top: "ex_0_fc6"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 1024
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_0_relu6"
        type: "ReLU"
        bottom: "ex_0_fc6"
        top: "ex_0_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_0_drop6"
        type: "Dropout"
        bottom: "ex_0_relu6"
        top: "ex_0_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        dropout_param {
          dropout_ratio: 0.5
        }
      }
      layer {
        name: "ex_0_fc7"
        type: "InnerProduct"
        bottom: "ex_0_relu6"
        top: "ex_0_fc7"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 2048
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_0_qu"
        type: "Quantizer"
        bottom: "ex_0_fc7"
        top: "ex_0_qu"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_FLOAT
      }
    }
    expert_net {
      reduced_memory_inference: true
      layer {
        name: "ex_1_input"
        type: "Input"
        top: "ex_1_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 1
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ex_1_conv2"
        type: "Convolution"
        bottom: "ex_1_input"
        top: "ex_1_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_1_relu2"
        type: "ReLU"
        bottom: "ex_1_conv2"
        top: "ex_1_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_1_pool2"
        type: "Pooling"
        bottom: "ex_1_relu2"
        top: "ex_1_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_1_norm2"
        type: "LRN"
        bottom: "ex_1_pool2"
        top: "ex_1_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ex_1_conv3"
        type: "Convolution"
        bottom: "ex_1_norm2"
        top: "ex_1_conv3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ex_1_relu3"
        type: "ReLU"
        bottom: "ex_1_conv3"
        top: "ex_1_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_1_conv4"
        type: "Convolution"
        bottom: "ex_1_relu3"
        top: "ex_1_conv4"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_1_relu4"
        type: "ReLU"
        bottom: "ex_1_conv4"
        top: "ex_1_relu4"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_1_conv5"
        type: "Convolution"
        bottom: "ex_1_relu4"
        top: "ex_1_conv5"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_1_relu5"
        type: "ReLU"
        bottom: "ex_1_conv5"
        top: "ex_1_relu5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_1_pool5"
        type: "Pooling"
        bottom: "ex_1_relu5"
        top: "ex_1_pool5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_1_fc6"
        type: "InnerProduct"
        bottom: "ex_1_pool5"
        top: "ex_1_fc6"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 1024
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_1_relu6"
        type: "ReLU"
        bottom: "ex_1_fc6"
        top: "ex_1_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_1_drop6"
        type: "Dropout"
        bottom: "ex_1_relu6"
        top: "ex_1_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        dropout_param {
          dropout_ratio: 0.5
        }
      }
      layer {
        name: "ex_1_fc7"
        type: "InnerProduct"
        bottom: "ex_1_relu6"
        top: "ex_1_fc7"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 2048
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_1_qu"
        type: "Quantizer"
        bottom: "ex_1_fc7"
        top: "ex_1_qu"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_FLOAT
      }
    }
    expert_net {
      reduced_memory_inference: true
      layer {
        name: "ex_2_input"
        type: "Input"
        top: "ex_2_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 1
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ex_2_conv2"
        type: "Convolution"
        bottom: "ex_2_input"
        top: "ex_2_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_2_relu2"
        type: "ReLU"
        bottom: "ex_2_conv2"
        top: "ex_2_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_2_pool2"
        type: "Pooling"
        bottom: "ex_2_relu2"
        top: "ex_2_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_2_norm2"
        type: "LRN"
        bottom: "ex_2_pool2"
        top: "ex_2_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ex_2_conv3"
        type: "Convolution"
        bottom: "ex_2_norm2"
        top: "ex_2_conv3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ex_2_relu3"
        type: "ReLU"
        bottom: "ex_2_conv3"
        top: "ex_2_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_2_conv4"
        type: "Convolution"
        bottom: "ex_2_relu3"
        top: "ex_2_conv4"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_2_relu4"
        type: "ReLU"
        bottom: "ex_2_conv4"
        top: "ex_2_relu4"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_2_conv5"
        type: "Convolution"
        bottom: "ex_2_relu4"
        top: "ex_2_conv5"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_2_relu5"
        type: "ReLU"
        bottom: "ex_2_conv5"
        top: "ex_2_relu5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_2_pool5"
        type: "Pooling"
        bottom: "ex_2_relu5"
        top: "ex_2_pool5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_2_fc6"
        type: "InnerProduct"
        bottom: "ex_2_pool5"
        top: "ex_2_fc6"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 1024
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_2_relu6"
        type: "ReLU"
        bottom: "ex_2_fc6"
        top: "ex_2_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_2_drop6"
        type: "Dropout"
        bottom: "ex_2_relu6"
        top: "ex_2_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        dropout_param {
          dropout_ratio: 0.5
        }
      }
      layer {
        name: "ex_2_fc7"
        type: "InnerProduct"
        bottom: "ex_2_relu6"
        top: "ex_2_fc7"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 2048
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_2_qu"
        type: "Quantizer"
        bottom: "ex_2_fc7"
        top: "ex_2_qu"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_FLOAT
      }
    }
    expert_net {
      reduced_memory_inference: true
      layer {
        name: "ex_3_input"
        type: "Input"
        top: "ex_3_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 1
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ex_3_conv2"
        type: "Convolution"
        bottom: "ex_3_input"
        top: "ex_3_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_3_relu2"
        type: "ReLU"
        bottom: "ex_3_conv2"
        top: "ex_3_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_3_pool2"
        type: "Pooling"
        bottom: "ex_3_relu2"
        top: "ex_3_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_3_norm2"
        type: "LRN"
        bottom: "ex_3_pool2"
        top: "ex_3_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ex_3_conv3"
        type: "Convolution"
        bottom: "ex_3_norm2"
        top: "ex_3_conv3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ex_3_relu3"
        type: "ReLU"
        bottom: "ex_3_conv3"
        top: "ex_3_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_3_conv4"
        type: "Convolution"
        bottom: "ex_3_relu3"
        top: "ex_3_conv4"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_3_relu4"
        type: "ReLU"
        bottom: "ex_3_conv4"
        top: "ex_3_relu4"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_3_conv5"
        type: "Convolution"
        bottom: "ex_3_relu4"
        top: "ex_3_conv5"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_3_relu5"
        type: "ReLU"
        bottom: "ex_3_conv5"
        top: "ex_3_relu5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_3_pool5"
        type: "Pooling"
        bottom: "ex_3_relu5"
        top: "ex_3_pool5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_3_fc6"
        type: "InnerProduct"
        bottom: "ex_3_pool5"
        top: "ex_3_fc6"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 1024
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_3_relu6"
        type: "ReLU"
        bottom: "ex_3_fc6"
        top: "ex_3_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_3_drop6"
        type: "Dropout"
        bottom: "ex_3_relu6"
        top: "ex_3_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        dropout_param {
          dropout_ratio: 0.5
        }
      }
      layer {
        name: "ex_3_fc7"
        type: "InnerProduct"
        bottom: "ex_3_relu6"
        top: "ex_3_fc7"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 2048
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_3_qu"
        type: "Quantizer"
        bottom: "ex_3_fc7"
        top: "ex_3_qu"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_FLOAT
      }
    }
    expert_net {
      reduced_memory_inference: true
      layer {
        name: "ex_4_input"
        type: "Input"
        top: "ex_4_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 1
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ex_4_conv2"
        type: "Convolution"
        bottom: "ex_4_input"
        top: "ex_4_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_4_relu2"
        type: "ReLU"
        bottom: "ex_4_conv2"
        top: "ex_4_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_4_pool2"
        type: "Pooling"
        bottom: "ex_4_relu2"
        top: "ex_4_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_4_norm2"
        type: "LRN"
        bottom: "ex_4_pool2"
        top: "ex_4_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ex_4_conv3"
        type: "Convolution"
        bottom: "ex_4_norm2"
        top: "ex_4_conv3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ex_4_relu3"
        type: "ReLU"
        bottom: "ex_4_conv3"
        top: "ex_4_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_4_conv4"
        type: "Convolution"
        bottom: "ex_4_relu3"
        top: "ex_4_conv4"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_4_relu4"
        type: "ReLU"
        bottom: "ex_4_conv4"
        top: "ex_4_relu4"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_4_conv5"
        type: "Convolution"
        bottom: "ex_4_relu4"
        top: "ex_4_conv5"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_4_relu5"
        type: "ReLU"
        bottom: "ex_4_conv5"
        top: "ex_4_relu5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_4_pool5"
        type: "Pooling"
        bottom: "ex_4_relu5"
        top: "ex_4_pool5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_4_fc6"
        type: "InnerProduct"
        bottom: "ex_4_pool5"
        top: "ex_4_fc6"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 1024
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_4_relu6"
        type: "ReLU"
        bottom: "ex_4_fc6"
        top: "ex_4_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_4_drop6"
        type: "Dropout"
        bottom: "ex_4_relu6"
        top: "ex_4_relu6"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        dropout_param {
          dropout_ratio: 0.5
        }
      }
      layer {
        name: "ex_4_fc7"
        type: "InnerProduct"
        bottom: "ex_4_relu6"
        top: "ex_4_fc7"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        inner_product_param {
          num_output: 2048
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_4_qu"
        type: "Quantizer"
        bottom: "ex_4_fc7"
        top: "ex_4_qu"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_FLOAT
      }
    }
    expert_net {
      reduced_memory_inference: true
      layer {
        name: "ex_5_input"
        type: "Input"
        top: "ex_5_input"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        input_param {
          shape {
            dim: 1
            dim: 48
            dim: 27
            dim: 27
          }
        }
      }
      layer {
        name: "ex_5_conv2"
        type: "Convolution"
        bottom: "ex_5_input"
        top: "ex_5_conv2"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 2
          kernel_size: 5
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_5_relu2"
        type: "ReLU"
        bottom: "ex_5_conv2"
        top: "ex_5_relu2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_5_pool2"
        type: "Pooling"
        bottom: "ex_5_relu2"
        top: "ex_5_pool2"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
          pool: MAX
          kernel_size: 3
          stride: 2
        }
      }
      layer {
        name: "ex_5_norm2"
        type: "LRN"
        bottom: "ex_5_pool2"
        top: "ex_5_norm2"
        bottom_data_type: CAFFE_FLOAT
        compute_data_type: CAFFE_FLOAT
        top_data_type: CAFFE_FLOAT
        lrn_param {
          local_size: 5
          alpha: 9.999999747378752e-05
          beta: 0.75
          engine: CAFFE
        }
      }
      layer {
        name: "ex_5_conv3"
        type: "Convolution"
        bottom: "ex_5_norm2"
        top: "ex_5_conv3"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.0
          }
        }
      }
      layer {
        name: "ex_5_relu3"
        type: "ReLU"
        bottom: "ex_5_conv3"
        top: "ex_5_relu3"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_5_conv4"
        type: "Convolution"
        bottom: "ex_5_relu3"
        top: "ex_5_conv4"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 96
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_5_relu4"
        type: "ReLU"
        bottom: "ex_5_conv4"
        top: "ex_5_relu4"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_5_conv5"
        type: "Convolution"
        bottom: "ex_5_relu4"
        top: "ex_5_conv5"
        param {
          lr_mult: 1.0
          decay_mult: 1.0
        }
        param {
          lr_mult: 2.0
          decay_mult: 0.0
        }
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        convolution_param {
          num_output: 64
          pad: 1
          kernel_size: 3
          group: 2
          weight_filler {
            type: "gaussian"
            std: 0.009999999776482582
          }
          bias_filler {
            type: "constant"
            value: 0.5
          }
        }
      }
      layer {
        name: "ex_5_relu5"
        type: "ReLU"
        bottom: "ex_5_conv5"
        top: "ex_5_relu5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
      }
      layer {
        name: "ex_5_pool5"
        type: "Pooling"
        bottom: "ex_5_relu5"
        top: "ex_5_pool5"
        bottom_data_type: CAFFE_HALF
        compute_data_type: CAFFE_HALF
        top_data_type: CAFFE_HALF
        pooling_param {
